controllers/restapi/ApprovalController.php

public function actionReject($requestId){
       $approvalMapping = ApprovalMapping::findOne(['userId'=> Yii::$app->user->id]);
    if(RequestApproval::findOne(['requestId'=> $requestId, 'approvalLevelId' => $approvalMapping->approvalLevelId - 1] )){
    $requestApproval = new RequestApproval();
    $request = Request::findOne(['id'=>$requestId]);
    $requestApproval = new RequestApproval();
    $request->approvalStatus = 'Rejected';

    // update requestApproval data
    $requestApproval->approvalStatus = 'Rejected';
    $requestApproval->approvalPersonId = Yii::$app->user->id;
    $requestApproval->approvalLevelId = ApprovalMapping::findOne(['userId'=> Yii::$app->user->id])->approvalLevelId;

    // save request and requestApproval
    $request->save();
    $requestApproval->save();
---
SELECT EXISTS(SELECT * FROM `approval_level` WHERE `approval_level`.`id`=2)
SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=3)
UPDATE `request` SET `approvalStatus`='Rejected' WHERE `id`=1
INSERT INTO `request_approval` (`approvalStatus`, `approvalPersonId`, `approvalLevelId`) VALUES ('Rejected', 3, 2)